In [1]:
import numpy as np
import pandas as pd

- Сложение DF

In [2]:
df1 = pd.DataFrame({'A': [1, 2, 3]})
df2 = pd.DataFrame({'B': [1, 2, 3]})

Важная особенность сложения датафрэймов
Складываться будут только значения в тех ячейках, где индексы и лейблы одинаковые
Разберем на примере

In [7]:
df1

   A
0  1
1  2
2  3

In [4]:
df2

   B
0  1
1  2
2  3

In [8]:
#Мы получили NaN
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN
2 NaN NaN

- Пропущенные значения 

Функции ниже ничего не записывают в датафрейм. Они просто пытаются выполнить свою работу и если одно из слагаемых NaN, тогда оно подменяется на значение из параметра fill_value. 

Если и и там будет NaN, то тут уже не сработает.

 

Функции:

add, radd - сложение

sub, rsub - вычитание

div, rdiv - деление

mul, rmul - умножение

pow, rpow - возведение в степень

 

Чем отличается функция с буквой r в начале?. Покажу на примере:

df / 5  - означает, разделить все значения датафрейма на 5. Тоже самое: df.div(5)  (да-да, в функцию можно и число передавать)

А как например записать наборот?: 5 / df т.е. пятёрку разделить на каждый элемент датафрейма. Вот для этого и нужна функция rdiv:  df.rdiv(5).

 

Т.е. функции с буквой r как-бы меняют местами наши элементы.

In [9]:
df1 = pd.DataFrame({'visits':[100,200,300]}, index=['Kazan', 'Vladivostok','Moscow'])
df2 = pd.DataFrame({'visits':[200, np.nan, 400]}, index=['Kazan', 'Vladivostok','Moscow'])

In [10]:
#Посещения сайта за январь
df1

             visits
Kazan           100
Vladivostok     200
Moscow          300

In [12]:
#Посещения сайта за февраль
df2

             visits
Kazan         200.0
Vladivostok     NaN
Moscow        400.0

In [14]:
#И вот какой результат мы получаем если складываем NaN
df1 + df2

             visits
Kazan         300.0
Vladivostok     NaN
Moscow        700.0

In [16]:
#Если просто записать так. то это будет эквивалентная операция
df1.add(df2)

             visits
Kazan         300.0
Vladivostok     NaN
Moscow        700.0

- fill_value - параметр в .add(), который заполняет пропуски заданными значениями

Теже самые параметры есть для сложения и умножения

In [19]:
#Вместо этого давайте запишем на что мы хотим заменять NaN
df1.add(df2, fill_value=0)

             visits
Kazan         300.0
Vladivostok   200.0
Moscow        700.0

- Попробуем прибавить к DataFrame серию

In [21]:
df3 = pd.DataFrame({'a':[100,200,300], 
                    'b': [1,2,3]}, index=['Kazan', 'Vladivostok','Moscow'])

In [22]:
df3

               a  b
Kazan        100  1
Vladivostok  200  2
Moscow       300  3

In [24]:
s1 = pd.Series([1,2], index=['a','b'])
s1

a    1
b    2
dtype: int64

In [25]:
df3 + s1

               a  b
Kazan        101  3
Vladivostok  201  4
Moscow       301  5

In [29]:
#Изменим нашу серию для большей наглядности
s2 = pd.Series([1], index=['a'])
s2

a    1
dtype: int64

In [31]:
df3 + s2

                 a   b
Kazan        101.0 NaN
Vladivostok  201.0 NaN
Moscow       301.0 NaN

Как мы видим серия прибавляется к датафрэйму по лейблам, которые уже существуют. Там, где лейбла нет, ставятся NaN

In [33]:
#Добавим индекс к нашей серии, которого нет в DF
s3 = pd.Series([1,2], index=['a','c'])
s3

a    1
c    2
dtype: int64

In [35]:
#Теперь у нас два столбца с пропущенными значениями
df3 + s3

                 a   b   c
Kazan        101.0 NaN NaN
Vladivostok  201.0 NaN NaN
Moscow       301.0 NaN NaN

- Оси

Допустим нам нужно пробежать на по столбцу, а по строке. Для этого необходимо изменить знакомый нам параметр axis

In [37]:
s4 = pd.Series([1,2], index=['Kazan','Moscow'])
s4

Kazan     1
Moscow    2
dtype: int64

In [40]:
df3.add(s4, axis = 0)

                 a    b
Kazan        101.0  2.0
Moscow       302.0  5.0
Vladivostok    NaN  NaN

- Сортировка значений

In [41]:
s5 = pd.Series([1,-2,3,-4], index = ['c','a','b','d'])
s5

c    1
a   -2
b    3
d   -4
dtype: int64

In [46]:
#Сортировка по индексам
s5.sort_index()

a   -2
b    3
c    1
d   -4
dtype: int64

In [45]:
s5.sort_index(ascending=False)

d   -4
c    1
b    3
a   -2
dtype: int64

In [47]:
s5.sort_values()

d   -4
a   -2
c    1
b    3
dtype: int64

In [48]:
s5.sort_values(ascending=False)

b    3
c    1
a   -2
d   -4
dtype: int64

- Сортировка с ДатаФрэймом

In [54]:
df = pd.DataFrame(np.arange(12).reshape((4,3)), columns=list('ebd'), index=['a','d','c','e'])
df

   e   b   d
a  0   1   2
d  3   4   5
c  6   7   8
e  9  10  11

In [57]:
df.sort_index(axis = 0, ascending = False)

   e   b   d
e  9  10  11
d  3   4   5
c  6   7   8
a  0   1   2

In [58]:
df.sort_index(axis = 1, ascending = False)

   e   d   b
a  0   2   1
d  3   5   4
c  6   8   7
e  9  11  10

- Сортировка Датафрэйма по значению

In [70]:
data = [['Ivan', 25, 4, 50, 1], 
        ['Petr', 40, 9, 250, 8], 
        ['Nikolay', 19, 12, 25, 1], 
        ['Sergey', 33, 6, 115, 6],
        ['Andrey', 38, 2, 152, 4],
        ['Ilya', 20, 18, 15, 2],
        ['Igor', 19, 2, 10, 1]]
df = pd.DataFrame(data, columns=['name', 'age', 'uclicks', 'balance', 'history'], index=list('abcdecg'))
df

      name  age  uclicks  balance  history
a     Ivan   25        4       50        1
b     Petr   40        9      250        8
c  Nikolay   19       12       25        1
d   Sergey   33        6      115        6
e   Andrey   38        2      152        4
c     Ilya   20       18       15        2
g     Igor   19        2       10        1

In [71]:
#Сортировка по одной колонке
df.sort_values(by='age')

      name  age  uclicks  balance  history
c  Nikolay   19       12       25        1
g     Igor   19        2       10        1
c     Ilya   20       18       15        2
a     Ivan   25        4       50        1
d   Sergey   33        6      115        6
e   Andrey   38        2      152        4
b     Petr   40        9      250        8

In [72]:
#Сортировка по двум колонкам
df.sort_values(by=['age','balance'])

      name  age  uclicks  balance  history
g     Igor   19        2       10        1
c  Nikolay   19       12       25        1
c     Ilya   20       18       15        2
a     Ivan   25        4       50        1
d   Sergey   33        6      115        6
e   Andrey   38        2      152        4
b     Petr   40        9      250        8

- Еще об индексах

In [73]:
s1 = pd.Series([5,3,2,4,3],index = ['a','b','c','d','d'])
s1

a    5
b    3
c    2
d    4
d    3
dtype: int64

In [74]:
#Позволяет проверять есть ли дублирование индексов
s1.index.is_unique

False

In [77]:
#По одному индексу мы получваем сразу две строки, что не есть правильно)
df.loc['c']

      name  age  uclicks  balance  history
c  Nikolay   19       12       25        1
c     Ilya   20       18       15        2